c1=3; % закупівельна ціна одиниці продукції(без знижки)  
c2=2.9; % закупівельна ціна одиниці продукції(зі знижкою знижки)  
q=10000; % об'єм закупівлі продукції для надання знижки
D=150*1.25; % кількість товару, що реалізується за одиницю часу
h=0.02; % витрати на зберігання одиниці продукції за період часу
K=20; % фіксовані витрати, пов'язані з розміщенням замовлення
L=2; % строк виконання замовлення
M=12000; % ємність складу
% 1.Побудуйте графік функції TCU(y)
y=0:90:2000; 
TCU1=c1*D+K*D./y+h*(y/2); % без знижки
TCU2=c2*D+K*D./y+h*(y/2); % зі знижкою
plot(y,TCU1,y,TCU2)
xlabel('Обсяг замовлення');
ylabel('Витрати');
title('TCU');
legend('TCU без знижки', 'TCU зі знижкою');
grid on;
% 2.Визначте економічний обсяг замовлення
Ye=sqrt((2*K*D)/h); % економічний обсяг замовлення
disp('Економічний обсяг замовлення');
disp(Ye);
% 3.Визначте оптимальний обсяг замовлення з врахуванням ємності складу
if Ye<=M
    Yo=Ye;
else
    Yo=M;
end
disp('Оптимальний обсяг замовлення');
disp(Yo);
% 4.Знайдіть точку поновлення запасів.
W=L*D;
disp('Точка поновлення запасів');
disp(W);
% 5.Знайдіть значення Q 
TCU=c1*D+K*D./Yo+h*(Yo/2);
Disk=((2*(c2*D-TCU))/h)^2-4*1*(2*K*D)/h;
root1=(-(2*(c2*D-TCU))/h+sqrt(Disk))/2;
root2=(-(2*(c2*D-TCU))/h-sqrt(Disk))/2;
disp('Значення Q 1');
disp(num2str(root1));
disp('Значення Q 2');
disp(num2str(root2));
%  Визначте,  який  з  трьох  розглянутих  вище  випадків  має  місце  
if q>=0 && q<Yo  
    Y=Yo;
    f=1; % флаг для встановлення зони попадання
elseif q>=Yo && q<root1
     Y=q;
     f=2;
else
    Y=Yo;
    f=3;
end
disp('Зона');
disp(f);
disp('Обсяг замовлення');
disp(Y);